Revit 2027 API
PartUtils.GetAssociatedParts Method
Overload List
Name | Description
GetAssociatedParts(Document, ElementId, Boolean, Boolean) |  Returns all Parts that are associated with the given element.
GetAssociatedParts(Document, LinkElementId, Boolean, Boolean) |  Returns all Parts that are associated with the given element
Top
See Also
Reference
PartUtils Class
Autodesk.Revit.DB Namespace